src_ext/InformationRegisters/УЗ_НастройкиОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиОплатыQR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_КлючиОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_КлючиОплатыQR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыОплатыQR</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеАбонемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветБота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеБоту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Catalogs/УЗ_Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИсториюЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/CommonModules/УЗ_ОплатыQR/Ext/Module.bsl
//Оплата по QR через СБП (этап 2.3, В65–В70): документ «Счёт на оплату по QR» — кто платит, за кого и за что
//(расшифровка, как у прихода денег), QR и ссылка от банка организации, статус. Менеджер выставляет QR у стойки
//(картинка на экране) или отправляет ссылку каналом сообщений; семья — командой бота /оплатить. Регламентное задание
//раз в минуту спрашивает банк о статусе ожидающих счетов (приёма уведомлений от банка нет — нет HTTP-сервиса) и по
//оплате создаёт и проводит приход денег «Касса ученики» в кассу поступлений по QR с той же расшифровкой. Повторная
//обработка той же оплаты второго прихода не создаёт (блокировка счёта, ссылка на приход в счёте и основание прихода).
//Запросы к банку — УЗ_ПровайдерыОплатQR (Точка, Т-Банк) через единственную точку HTTP с песочницей.

#Область ПрограммныйИнтерфейс

//Может ли пользователь выставлять QR и отправлять ссылку (менеджер, руководитель).
Функция ПравоВыставлять() Экспорт
	Возврат ПравоДоступа("Изменение", Метаданные.Документы.УЗ_СчетНаОплатуQR);
КонецФункции

//Может ли пользователь менять настройки банка (руководитель).
Функция ЕстьПравоНастройки() Экспорт
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_НастройкиОплатыQR);
КонецФункции

//Почему организация сейчас не примет оплату по QR ("" — готова): настройки банка, ключ, касса поступлений своей
//организации, безопасный режим (HTTP в нём запрещён; песочнице тестов он не помеха — запрос наружу и так не уйдёт).
Функция ПричинаНеготовности(Организация) Экспорт

	Причина = "";
	Параметры = УЗ_ПровайдерыОплатQR.ПараметрыБанка(Организация, Причина);
	Если Параметры = Неопределено Тогда
		Возврат Причина;
	КонецЕсли;
	Причина = ПричинаКассы(Параметры);
	Если Не ПустаяСтрока(Причина) Тогда
		Возврат Причина;
	КонецЕсли;
	Если УЗ_Общий.БезопасныйРежимДействует() И Не УЗ_Почта.ПесочницаВключена() Тогда
		Возврат ТекстБезопасногоРежима();
	КонецЕсли;
	Возврат "";

КонецФункции

//«Запросы к банку в безопасном режиме запрещены» и как его снять.
Функция ТекстБезопасногоРежима() Экспорт
	Возврат НСтр("ru = 'Оплата по QR: запросы к банку в безопасном режиме запрещены.'") + " "
		+ УЗ_Общий.КакСнятьБезопасныйРежим();
КонецФункции

//Настройки банка организации без ключа: Включен, Провайдер, АдресСервиса, Логин, НомерСчета, Касса, СрокМинут,
//КлючЗадан.
Функция НастройкиОрганизации(Организация) Экспорт

	Итог = Новый Структура(
		"Организация, Включен, Провайдер, АдресСервиса, Логин, НомерСчета, Касса, СрокМинут, КлючЗадан",
		Организация, Ложь, Перечисления.УЗ_ПровайдерыОплатыQR.ПустаяСсылка(), "", "", "",
			Справочники.УЗ_Кассы.ПустаяСсылка(),
		0, Ложь);
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Запись = РегистрыСведений.УЗ_НастройкиОплатыQR.СоздатьМенеджерЗаписи();
		Запись.Организация = Организация;
		Запись.Прочитать();
		Ключ = РегистрыСведений.УЗ_КлючиОплатыQR.СоздатьМенеджерЗаписи();
		Ключ.Организация = Организация;
		Ключ.Прочитать();
		Итог.КлючЗадан = Ключ.Выбран() И Не ПустаяСтрока(Ключ.Ключ);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		//безопасный режим: привилегированный режим не действует — запросов к банку всё равно не будет
		УстановитьПривилегированныйРежим(Ложь);
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Итог;
	КонецПопытки;
	Если Запись.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(Итог, Запись, "Включен, Провайдер, АдресСервиса, Логин, НомерСчета, Касса, СрокМинут");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Записать настройки банка организации (руководитель). Ключ меняется, только если ИзменитьКлюч (в форму ключ не
//передаётся, поле пустое). Данные — Включен, Провайдер, АдресСервиса, Логин, НомерСчета, Касса, СрокМинут.
Процедура СохранитьНастройки(Организация, Данные, НовыйКлюч = "", ИзменитьКлюч = Ложь) Экспорт

	Если Не ЕстьПравоНастройки() Тогда
		ВызватьИсключение НСтр("ru = 'Настройки оплаты по QR может менять только руководитель.'");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_НастройкиОплатыQR.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Прочитать();
	Запись.Организация = Организация;
	ЗаполнитьЗначенияСвойств(Запись, Данные, "Включен, Провайдер, АдресСервиса, Логин, НомерСчета, Касса, СрокМинут");
	Запись.Записать();
	Если ИзменитьКлюч Тогда
		ЗаписатьКлюч(Организация, НовыйКлюч);
	КонецЕсли;

КонецПроцедуры

//Записать ключ банка организации (руководитель): ключ хранится в регистре без прав у ролей.
Процедура ЗаписатьКлюч(Организация, НовыйКлюч) Экспорт

	Если Не ЕстьПравоНастройки() Тогда
		ВызватьИсключение НСтр("ru = 'Ключ банка может менять только руководитель.'");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Ключ = РегистрыСведений.УЗ_КлючиОплатыQR.СоздатьМенеджерЗаписи();
	Ключ.Организация = Организация;
	Ключ.Ключ = СокрЛП(НовыйКлюч);
	Ключ.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

//Задан ли ключ банка организации (для формы настроек: сам ключ в форму не передаётся).
Функция КлючЗадан(Организация) Экспорт
	Возврат НастройкиОрганизации(Организация).КлючЗадан;
КонецФункции

//Строки расшифровки по долгам: ученики — их долги в организации по предметам (УЗ_Сервер.ДолгиДляОплаты, как
//«Заполнить по долгам» прихода денег). Массив структур Ученик, ПредметОбучения, Абонемент, Тариф, Сумма.
Функция СтрокиПоДолгам(Ученики, Организация) Экспорт

	Итог = Новый Массив;
	Для Каждого Ученик Из Ученики Цикл
		Для Каждого Долг Из УЗ_Сервер.ДолгиДляОплаты(Ученик, Организация) Цикл
			Итог.Добавить(Новый Структура("Ученик, ПредметОбучения, Абонемент, Тариф, Сумма", Ученик,
				Долг.ПредметОбучения,
				Справочники.УЗ_Абонемент.ПустаяСсылка(), Справочники.УЗ_Тарифы.ПустаяСсылка(), Долг.Сумма));
		КонецЦикла;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//За кого платит человек: ученики, у кого он в плательщиках; ни за кого — он сам (ученик платит за себя).
Функция УченикиДляОплаты(ФизЛицо) Экспорт

	Ученики = Справочники.УЗ_ФизЛица.УченикиПлательщика(ФизЛицо);
	Если Ученики.Количество() = 0 Тогда
		Ученики.Добавить(ФизЛицо);
	КонецЕсли;
	Возврат Ученики;

КонецФункции

//Выставить QR по записанному счёту: банк регистрирует динамический QR на сумму счёта, в счёт — идентификатор,
//ссылка на оплату, картинка, срок, статус «Ждёт оплаты». Действующий QR второй раз не выставляется; оплаченный
//счёт — отказ. Истёкший, отменённый, отклонённый — выставляется заново (новый QR).
//Структура: Успех, ТекстОшибки, Ссылка, СрокДействия.
Функция ВыставитьQR(Счет) Экспорт

	ПроверитьПравоВыставлять();
	Возврат ВыставитьQRСчета(Счет);

КонецФункции

//Спросить банк о статусе оплаты счёта и обработать ответ: оплачен — приход денег (ОбработатьОплату); отклонён,
//истёк, отменён банком — статус счёта; срок QR прошёл, а банк молчит (Точка) — «Срок истёк».
//  ЦиклПроверки — Структура Недоступны (Соответствие Организация → ошибка банка) от регламентного задания: банк
//  отказал как сервис — остальные счета этой организации в этом цикле не спрашиваем.
//Структура: Статус (УЗ_СтатусыОплатыQR), ТекстОшибки, ПриходДенег.
Функция ПроверитьОплату(Счет, ЦиклПроверки = Неопределено) Экспорт

	Если ЦиклПроверки = Неопределено Тогда
		ПроверитьПравоВыставлять();
	КонецЕсли;
	Реквизиты = РеквизитыСчета(Счет);
	Итог = Новый Структура("Статус, ТекстОшибки, ПриходДенег", Реквизиты.Статус, "", Реквизиты.ПриходДенег);
	Статусы = Перечисления.УЗ_СтатусыОплатыQR;
	Если ЗначениеЗаполнено(Реквизиты.ПриходДенег) Тогда
		Возврат Итог;
	КонецЕсли;
	Если Реквизиты.Статус <> Статусы.Ожидает И Реквизиты.Статус <> Статусы.Отменен
		И Реквизиты.Статус <> Статусы.Оплачен Или ПустаяСтрока(Реквизиты.ИдентификаторQR) Тогда
		Возврат Итог;
	КонецЕсли;
	Если ЦиклПроверки <> Неопределено И ЦиклПроверки.Недоступны.Получить(Реквизиты.Организация) <> Неопределено Тогда
		Итог.ТекстОшибки = НСтр("ru = 'не спрашивали: банк недоступен в этом цикле —'") + " "
			+ ЦиклПроверки.Недоступны.Получить(Реквизиты.Организация);
		Возврат Итог;
	КонецЕсли;
	Причина = "";
	Параметры = УЗ_ПровайдерыОплатQR.ПараметрыБанка(Реквизиты.Организация, Причина);
	Если Параметры = Неопределено Тогда
		Итог.ТекстОшибки = Причина;
		Возврат Итог;
	КонецЕсли;
	Ответ = УЗ_ПровайдерыОплатQR.СтатусОплаты(Параметры, Реквизиты.ИдентификаторQR);
	Если Не Ответ.Успех Тогда
		Итог.ТекстОшибки = Ответ.ТекстОшибки;
		Если Ответ.СервисНедоступен И ЦиклПроверки <> Неопределено Тогда
			ЦиклПроверки.Недоступны.Вставить(Реквизиты.Организация, Ответ.ТекстОшибки);
		КонецЕсли;
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УЗ_СчетНаОплатуQR, Счет, НСтр("ru = 'Статус оплаты не получен:'") + " "
				+ Ответ.ТекстОшибки);
		Возврат Итог;
	КонецЕсли;
	Если Ответ.Статус = "Оплачен" Тогда
		Обработка = ОбработатьОплату(Счет, Новый Структура("ИдОперации, ДатаОплаты, Сумма", Ответ.ИдОперации,
			ТекущаяДатаСеанса(), Ответ.Сумма));
		Итог.Статус = Статусы.Оплачен;
		Итог.ТекстОшибки = Обработка.ТекстОшибки;
		Итог.ПриходДенег = Обработка.ПриходДенег;
		Возврат Итог;
	КонецЕсли;
	НовыйСтатус = Неопределено;
	Если Ответ.Статус = "Отклонен" Тогда
		НовыйСтатус = Статусы.Отклонен;
	ИначеЕсли Ответ.Статус = "Истек" Тогда
		НовыйСтатус = Статусы.Истек;
	ИначеЕсли Ответ.Статус = "Отменен" Тогда
		НовыйСтатус = Статусы.Отменен;
	ИначеЕсли Реквизиты.Статус = Статусы.Ожидает И ТекущаяДатаСеанса() > Реквизиты.СрокДействия + ЗапасСрокаСекунд(
		) Тогда
		НовыйСтатус = Статусы.Истек;
	КонецЕсли;
	Если НовыйСтатус <> Неопределено И НовыйСтатус <> Реквизиты.Статус Тогда
		ЗаписатьСтатус(Счет, НовыйСтатус, СтрШаблон(НСтр("ru = 'Банк: %1'"), Ответ.СтатусБанка));
		Итог.Статус = НовыйСтатус;
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Отменить выставленный QR: сначала — последний вопрос банку (оплачен — обрабатываем оплату, отмены нет), затем
//отмена в банке (Т-Банк) и статус «Отменён». QR Точки банк не отменяет — он живёт до своего срока, и задание
//спрашивает о нём до срока: оплата после отмены всё равно станет приходом (деньги же пришли).
//Структура: Успех, ТекстОшибки, Статус.
Функция ОтменитьQR(Счет) Экспорт

	ПроверитьПравоВыставлять();
	Итог = Новый Структура("Успех, ТекстОшибки, Статус", Ложь, "", Неопределено);
	Проверка = ПроверитьОплату(Счет);
	Итог.Статус = Проверка.Статус;
	Если Проверка.Статус = Перечисления.УЗ_СтатусыОплатыQR.Оплачен Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Счёт уже оплачен — отменять нечего (приход денег создан по оплате).'");
		Возврат Итог;
	ИначеЕсли Проверка.Статус <> Перечисления.УЗ_СтатусыОплатыQR.Ожидает Тогда
		Итог.ТекстОшибки = СтрШаблон(НСтр("ru = 'QR не ждёт оплаты (статус «%1») — отменять нечего.'"),
			Проверка.Статус);
		Возврат Итог;
	КонецЕсли;
	Реквизиты = РеквизитыСчета(Счет);
	Причина = "";
	Параметры = УЗ_ПровайдерыОплатQR.ПараметрыБанка(Реквизиты.Организация, Причина);
	Если Параметры = Неопределено Тогда
		Итог.ТекстОшибки = Причина;
		Возврат Итог;
	КонецЕсли;
	Ответ = УЗ_ПровайдерыОплатQR.ОтменитьQR(Параметры, Реквизиты.ИдентификаторQR);
	Если Не Ответ.Успех Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Банк не отменил QR:'") + " " + Ответ.ТекстОшибки;
		Возврат Итог;
	КонецЕсли;
	ЗаписатьСтатус(Счет, Перечисления.УЗ_СтатусыОплатыQR.Отменен, "");
	Итог.Успех = Истина;
	Итог.Статус = Перечисления.УЗ_СтатусыОплатыQR.Отменен;
	Возврат Итог;

КонецФункции

//Оплата по счёту пришла — приход денег «Касса ученики» (В67): дата — момент, когда узнали об оплате, касса
//поступлений по QR из настроек банка, плательщик и расшифровка по ученикам — из счёта, основание — счёт; проводится.
//Под исключительной блокировкой счёта: у счёта уже есть приход (или найден приход с этим основанием) — второй не
//создаётся (повтор задания, два сеанса, кнопка «Проверить оплату» одновременно с заданием). Приход не провёлся —
//счёт всё равно «Оплачен» (деньги у банка), ошибка — в счёте и журнале регистрации, задание повторит.
//  ДанныеОплаты — Структура ИдОперации, ДатаОплаты.
//Структура: Создан (Булево — создан этим вызовом), ПриходДенег, ТекстОшибки.
Функция ОбработатьОплату(Счет, ДанныеОплаты) Экспорт

	Итог = Новый Структура("Создан, ПриходДенег, ТекстОшибки", Ложь, Документы.УЗ_ПриходДенег.ПустаяСсылка(), "");
	ДатаОплаты = ?(ЗначениеЗаполнено(ДанныеОплаты.ДатаОплаты), ДанныеОплаты.ДатаОплаты, ТекущаяДатаСеанса());
	//приход по оплате создаёт система, а не менеджер: старые приходы ему не видны (граница просмотра кассы), а искать
	//приход по счёту нужно среди всех
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("Документ.УЗ_СчетНаОплатуQR");
		Элемент.УстановитьЗначение("Ссылка", Счет);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		Объект = Счет.ПолучитьОбъект();
		Приход = ?(ЗначениеЗаполнено(Объект.ПриходДенег), Объект.ПриходДенег, ПриходПоСчету(Счет));
		Если ЗначениеЗаполнено(Приход) Тогда
			Итог.ПриходДенег = Приход;
			Если Объект.ПриходДенег <> Приход Или Объект.Статус <> Перечисления.УЗ_СтатусыОплатыQR.Оплачен Тогда
				Объект.ПриходДенег = Приход;
				Объект.Статус = Перечисления.УЗ_СтатусыОплатыQR.Оплачен;
				ЗаписатьСлужебно(Объект);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
			УстановитьПривилегированныйРежим(Ложь);
			Возврат Итог;
		КонецЕсли;
		СуммаБанка = Неопределено;
		//Точка в статусе оплаты суммы не отдаёт: QR динамический, сумма зашита в нём и после выставления не меняется
		Если Не ДанныеОплаты.Свойство("Сумма", СуммаБанка) Или ТипЗнч(СуммаБанка) <> Тип("Число") Тогда
			СуммаБанка = Объект.СуммаДокумента;
		КонецЕсли;
		Если СуммаБанка <> Объект.СуммаДокумента Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Сумма оплаты банка %1 не совпадает с суммой счёта %2. Требуется сверка с банком.'"),
				СуммаБанка, Объект.СуммаДокумента);
		КонецЕсли;
		Приход = СоздатьПриход(Объект, ДанныеОплаты, ДатаОплаты);
		Объект.ПриходДенег = Приход;
		Объект.Статус = Перечисления.УЗ_СтатусыОплатыQR.Оплачен;
		Объект.ДатаОплаты = ДатаОплаты;
		Объект.ИдОперацииБанка = Строка(ДанныеОплаты.ИдОперации);
		Объект.ТекстОшибки = "";
		ЗаписатьСлужебно(Объект);
		ЗафиксироватьТранзакцию();
		Итог.Создан = Истина;
		Итог.ПриходДенег = Приход;
	Исключение
		ОтменитьТранзакцию();
		Итог.ТекстОшибки = НСтр("ru = 'Оплачено, но приход денег не создан:'") + " " + ТекстОшибкиПрихода(
			ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.УЗ_СчетНаОплатуQR, Счет, Итог.ТекстОшибки);
		//счёт всё равно оплачен: деньги у банка; задание повторит приход, ошибка видна в счёте
		Объект = Счет.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Объект.ПриходДенег) Тогда
			Объект.Статус = Перечисления.УЗ_СтатусыОплатыQR.Оплачен;
			Объект.ДатаОплаты = ДатаОплаты;
			Объект.ИдОперацииБанка = Строка(ДанныеОплаты.ИдОперации);
			Объект.ТекстОшибки = Лев(Итог.ТекстОшибки, 500);
			ЗаписатьСлужебно(Объект);
		КонецЕсли;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Итог;

КонецФункции

//Регламентное задание «Проверка оплат по QR (СБП)» (раз в минуту).
Процедура ПроверкаОплатРегламент() Экспорт

	ПроверитьПравоЗапуска();
	Если УЗ_Общий.БезопасныйРежимДействует() И Не УЗ_Почта.ПесочницаВключена() Тогда
		Если ЕстьОжидающие() Тогда
			ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
				ТекстБезопасногоРежима());
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ПроверитьОжидающиеОплаты();

КонецПроцедуры

//Спросить банк обо всех ожидающих счетах (Счета — массив ссылок; Неопределено — все): «Ждёт оплаты»; отменённые, у
//которых QR ещё действует (Точка не отменяет QR в банке); оплаченные без прихода (приход не провёлся — повтор).
//Структура: Проверено, Оплачено (приходов создано), Ошибок, Ошибки (Массив строк).
Функция ПроверитьОжидающиеОплаты(Счета = Неопределено) Экспорт

	ПроверитьПравоЗапуска();
	Итог = Новый Структура("Проверено, Оплачено, Ошибок, Ошибки", 0, 0, 0, Новый Массив);
	ЦиклПроверки = Новый Структура("Недоступны", Новый Соответствие);
	Для Каждого Счет Из ОжидающиеСчета(Счета) Цикл
		Итог.Проверено = Итог.Проверено + 1;
		Попытка
			Результат = ПроверитьОплату(Счет, ЦиклПроверки);
		Исключение
			Результат = Новый Структура("Статус, ТекстОшибки, ПриходДенег", Неопределено,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), Неопределено);
			ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.УЗ_СчетНаОплатуQR, Счет, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
			Итог.Ошибок = Итог.Ошибок + 1;
			Итог.Ошибки.Добавить(Строка(Счет) + ": " + Результат.ТекстОшибки);
		ИначеЕсли ЗначениеЗаполнено(Результат.ПриходДенег)
			И Результат.Статус = Перечисления.УЗ_СтатусыОплатыQR.Оплачен Тогда
			Итог.Оплачено = Итог.Оплачено + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Текст со ссылкой на оплату — для мессенджера, SMS, письма и бота.
Функция ТекстСсылки(Счет) Экспорт

	Реквизиты = РеквизитыСчета(Счет);
	Возврат СтрШаблон(НСтр("ru = 'Оплата занятий в «%1»: %2 руб.
		|Оплатить через СБП (приложение вашего банка): %3
		|Ссылка действует до %4.'"), Реквизиты.Организация, Формат(Реквизиты.СуммаДокумента, "ЧДЦ=2; ЧН=0,00"),
		Реквизиты.СсылкаНаОплату, Формат(Реквизиты.СрокДействия, "ДФ='HH:mm dd.MM.yyyy'"));

КонецФункции

//Отправить ссылку на оплату плательщику счёта (нет плательщика — ученику первой строки) его каналом (Telegram, SMS,
//WhatsApp, почта — как «Сообщение ученику»); попытка — в журнал сообщений, вид «Ссылка на оплату по QR».
//Структура: Отправлено, ТекстОшибки, Канал, Адрес.
Функция ОтправитьСсылку(Счет) Экспорт

	ПроверитьПравоВыставлять();
	Итог = Новый Структура("Отправлено, ТекстОшибки, Канал, Адрес", Ложь, "", Неопределено, "");
	Реквизиты = РеквизитыСчета(Счет);
	Если Реквизиты.Статус <> Перечисления.УЗ_СтатусыОплатыQR.Ожидает Или ТекущаяДатаСеанса(
		) > Реквизиты.СрокДействия Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Ссылки на оплату нет: сначала выставьте QR («Выставить QR»).'");
		Возврат Итог;
	КонецЕсли;
	Ученик = ?(Реквизиты.Расшифровка.Количество() = 0, Справочники.УЗ_ФизЛица.ПустаяСсылка(),
		Реквизиты.Расшифровка[0].Ученик);
	Кому = ?(ЗначениеЗаполнено(Реквизиты.Плательщик), Реквизиты.Плательщик, Ученик);
	Если Не ЗначениеЗаполнено(Кому) Тогда
		Итог.ТекстОшибки = НСтр("ru = 'В счёте не указан ни плательщик, ни ученик — некому отправить ссылку.'");
		Возврат Итог;
	КонецЕсли;
	Текст = ТекстСсылки(Счет);
	Сообщение = УЗ_Сообщения.НовоеСообщение(Перечисления.УЗ_ВидыСообщений.СсылкаНаОплату, Ученик,
		НСтр("ru = 'Ссылка на оплату занятий'"), Текст, Текст);
	Сообщение.Организация = Реквизиты.Организация;
	Сообщение.Сумма = Реквизиты.СуммаДокумента;
	Сообщение.Источник = Счет;
	Сообщение.Вручную = Истина;
	Результат = УЗ_Сообщения.ОтправитьФизЛицу(Кому, Сообщение);
	ЗаполнитьЗначенияСвойств(Итог, Результат, "Отправлено, ТекстОшибки, Канал, Адрес");
	Возврат Итог;

КонецФункции

//Ответ бота на /оплатить (В69): долг учеников чата по каждой организации, где подключена оплата по QR, — счёт и
//ссылка на оплату. Действующий счёт на ту же сумму того же плательщика — та же ссылка (новый QR не выставляется).
//  Плательщик — человек чата (он платит), Ученики — ученики чата.
Функция ОтветБотаНаОплату(Плательщик, Ученики) Экспорт

	Строки = Новый Массив;
	Для Каждого Организация Из ОрганизацииСДолгом(Ученики) Цикл
		Строки.Добавить(СтрокаОплатыБота(Плательщик, Ученики, Организация));
	КонецЦикла;
	Если Строки.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Долга нет — оплачивать сейчас нечего. Оплатить абонемент вперёд можно у администратора.'");
	КонецЕсли;
	Возврат СтрСоединить(Строки, Символы.ПС + Символы.ПС);

КонецФункции

//Картинка QR счёта для формы (ДвоичныеДанные) или Неопределено.
Функция КартинкаQR(Счет) Экспорт

	Хранилище = РеквизитыСчета(Счет).КартинкаQR;
	Если ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = Хранилище.Получить();
	Возврат ?(ТипЗнч(Данные) = Тип("ДвоичныеДанные"), Данные, Неопределено);

КонецФункции

//Свойство ДополнительныеСвойства, которым модуль оплат пишет служебные поля счёта (статус, QR, приход) мимо
//запрета правки выставленного счёта.
Функция КлючСлужебнойЗаписи() Экспорт
	Возврат "УЗ_СлужебнаяЗаписьОплатыQR";
КонецФункции

//Можно ли менять сумму и расшифровку счёта в этом статусе (выставленный и оплаченный — нельзя).
Функция МожноМенятьСчет(Статус) Экспорт
	Возврат Статус <> Перечисления.УЗ_СтатусыОплатыQR.Ожидает И Статус <> Перечисления.УЗ_СтатусыОплатыQR.Оплачен;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПравоВыставлять()

	Если Не ЭтоФоновоеЗадание() И Не ПравоВыставлять() Тогда
		ВызватьИсключение НСтр(
			"ru = 'Нет права выставлять QR для оплаты (роль «Учёт занятий: менеджер» или руководитель).'");
	КонецЕсли;

КонецПроцедуры

//Регламентное задание и бот идут фоновым заданием; вызов из сеанса пользователя (COM, клиент) — только с правом.
Процедура ПроверитьПравоЗапуска()

	Если Не ЭтоФоновоеЗадание() Тогда
		ВыполнитьПроверкуПравДоступа("Изменение", Метаданные.Документы.УЗ_СчетНаОплатуQR);
	КонецЕсли;

КонецПроцедуры

Функция ЭтоФоновоеЗадание()
	Возврат ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() <> Неопределено;
КонецФункции

//Выставить QR без проверки права (бот /оплатить в задании приёма сообщений — тоже сюда).
//Один счёт — одна банковская операция, включая одновременное выставление из двух сеансов.
Функция ВыставитьQRСчета(Счет)

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.УЗ_СчетНаОплатуQR");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Счет);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		Итог = ВыставитьQRПодБлокировкой(Счет);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Итог;

КонецФункции

Функция ВыставитьQRПодБлокировкой(Счет)

	Итог = Новый Структура("Успех, ТекстОшибки, Ссылка, СрокДействия", Ложь, "", "", '00010101');
	Объект = Счет.ПолучитьОбъект();
	Статусы = Перечисления.УЗ_СтатусыОплатыQR;
	Сейчас = ТекущаяДатаСеанса();
	Если Объект.Статус = Статусы.Оплачен Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Счёт уже оплачен.'");
		Возврат Итог;
	ИначеЕсли Объект.Статус = Статусы.Ожидает И Объект.СрокДействия > Сейчас Тогда
		Итог.Успех = Истина;
		Итог.Ссылка = Объект.СсылкаНаОплату;
		Итог.СрокДействия = Объект.СрокДействия;
		Возврат Итог;
	КонецЕсли;
	Если Не ПустаяСтрока(Объект.ИдентификаторQR) Тогда
		Итог.ТекстОшибки = НСтр("ru = 'По счёту уже выставлен QR. Для повторного выставления создайте новый счёт.'");
		Возврат Итог;
	КонецЕсли;
	Итог.ТекстОшибки = ПричинаНеВыставлять(Объект);
	Если ПустаяСтрока(Итог.ТекстОшибки) Тогда
		Итог.ТекстОшибки = ПричинаНеготовности(Объект.Организация);
	КонецЕсли;
	Если Не ПустаяСтрока(Итог.ТекстОшибки) Тогда
		Возврат Итог;
	КонецЕсли;
	Причина = "";
	Параметры = УЗ_ПровайдерыОплатQR.ПараметрыБанка(Объект.Организация, Причина);
	Данные = Новый Структура("Сумма, Назначение, НомерЗаказа, СрокДействия, СрокМинут", Объект.СуммаДокумента,
		НазначениеПлатежа(Объект), Строка(Новый УникальныйИдентификатор), Сейчас + Параметры.СрокМинут * 60,
		Параметры.СрокМинут);
	Ответ = УЗ_ПровайдерыОплатQR.СоздатьQR(Параметры, Данные);
	Если Не Ответ.Успех Тогда
		Итог.ТекстОшибки = НСтр("ru = 'QR не выставлен:'") + " " + Ответ.ТекстОшибки;
		Объект.ТекстОшибки = Лев(Итог.ТекстОшибки, 500);
		ЗаписатьСлужебно(Объект);
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УЗ_СчетНаОплатуQR, Счет, Итог.ТекстОшибки);
		Возврат Итог;
	КонецЕсли;
	Объект.Провайдер = Параметры.Провайдер;
	Объект.Статус = Статусы.Ожидает;
	Объект.ИдентификаторQR = Ответ.Идентификатор;
	Объект.СсылкаНаОплату = Ответ.Ссылка;
	Объект.КартинкаQR = Новый ХранилищеЗначения(Ответ.Картинка);
	Объект.СрокДействия = Данные.СрокДействия;
	Объект.НазначениеПлатежа = Данные.Назначение;
	Объект.ТекстОшибки = "";
	ЗаписатьСлужебно(Объект);
	Итог.Успех = Истина;
	Итог.Ссылка = Ответ.Ссылка;
	Итог.СрокДействия = Данные.СрокДействия;
	Возврат Итог;

КонецФункции

//Почему по счёту нельзя выставить QR ("" — можно): сумма, расшифровка, организация.
Функция ПричинаНеВыставлять(Объект)

	Если Объект.ЭтоНовый() Или Объект.Модифицированность() Тогда
		Возврат НСтр("ru = 'Запишите счёт перед выставлением QR.'");
	ИначеЕсли Объект.ПометкаУдаления Тогда
		Возврат НСтр("ru = 'Счёт помечен на удаление.'");
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат НСтр("ru = 'Укажите организацию: деньги придут на её счёт.'");
	ИначеЕсли Объект.СуммаДокумента <= 0 Тогда
		Возврат НСтр("ru = 'Сумма счёта должна быть больше нуля.'");
	ИначеЕсли Объект.Расшифровка.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Укажите, за кого и за что платят (расшифровка по ученикам).'");
	КонецЕсли;
	Для Каждого СтрокаОплаты Из Объект.Расшифровка Цикл
		Если Не ЗначениеЗаполнено(СтрокаОплаты.Ученик) Тогда
			Возврат СтрШаблон(НСтр("ru = 'Строка %1: укажите ученика.'"), СтрокаОплаты.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат "";

КонецФункции

//Назначение платежа для банка (до 140 знаков): из счёта или «Оплата занятий по счёту № N от дата».
Функция НазначениеПлатежа(Объект)

	Если Не ПустаяСтрока(Объект.НазначениеПлатежа) Тогда
		Возврат Лев(СокрЛП(Объект.НазначениеПлатежа), 140);
	КонецЕсли;
	Возврат Лев(СтрШаблон(НСтр("ru = 'Оплата занятий по счёту № %1 от %2'"), СокрЛП(Объект.Номер),
		Формат(Объект.Дата, "ДФ=dd.MM.yyyy")), 140);

КонецФункции

Функция ПричинаКассы(Параметры)

	Если Не ЗначениеЗаполнено(Параметры.Касса) Тогда
		Возврат СтрШаблон(НСтр("ru = 'В настройках оплаты по QR организации «%1» не указана касса поступлений по QR
			|(безналичная касса для СБП): приход денег по оплате некуда провести.'"), Параметры.Организация);
	КонецЕсли;
	Возврат Справочники.УЗ_Кассы.ТекстКассаДругойОрганизации(Параметры.Касса, Параметры.Организация);

КонецФункции

Функция ЗапасСрокаСекунд()
	Возврат 120;
КонецФункции

Функция РеквизитыСчета(Счет)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Счета.Статус КАК Статус,
	|	Счета.Организация КАК Организация,
	|	Счета.Плательщик КАК Плательщик,
	|	Счета.СуммаДокумента КАК СуммаДокумента,
	|	Счета.ИдентификаторQR КАК ИдентификаторQR,
	|	Счета.СсылкаНаОплату КАК СсылкаНаОплату,
	|	Счета.СрокДействия КАК СрокДействия,
	|	Счета.ДатаОплаты КАК ДатаОплаты,
	|	Счета.ИдОперацииБанка КАК ИдОперацииБанка,
	|	Счета.ПриходДенег КАК ПриходДенег,
	|	Счета.КартинкаQR КАК КартинкаQR
	|ИЗ
	|	Документ.УЗ_СчетНаОплатуQR КАК Счета
	|ГДЕ
	|	Счета.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Строки.Ученик КАК Ученик,
	|	Строки.Сумма КАК Сумма
	|ИЗ
	|	Документ.УЗ_СчетНаОплатуQR.Расшифровка КАК Строки
	|ГДЕ
	|	Строки.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строки.НомерСтроки";
	Запрос.УстановитьПараметр("Счет", Счет);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Счёт на оплату по QR не найден: %1'"), Счет);
	КонецЕсли;
	Итог = Новый Структура("Статус, Организация, Плательщик, СуммаДокумента, ИдентификаторQR, СсылкаНаОплату,
		|СрокДействия, ДатаОплаты, ИдОперацииБанка, ПриходДенег, КартинкаQR");
	ЗаполнитьЗначенияСвойств(Итог, Выборка);
	Итог.Вставить("Расшифровка", Пакет[1].Выгрузить());
	Возврат Итог;

КонецФункции

Процедура ЗаписатьСтатус(Счет, Статус, ТекстОшибки)

	Объект = Счет.ПолучитьОбъект();
	Объект.Статус = Статус;
	Объект.ТекстОшибки = Лев(ТекстОшибки, 500);
	ЗаписатьСлужебно(Объект);

КонецПроцедуры

//Запись служебных полей счёта (статус, QR, приход) мимо запрета правки выставленного счёта и мимо даты запрета:
//оплату банк подтверждает, когда подтверждает, — счёт вчерашнего закрытого дня всё равно становится «Оплачен»
//(сам приход — датой оплаты, его дата запрета проверяет как обычно).
Процедура ЗаписатьСлужебно(Объект)

	Объект.ДополнительныеСвойства.Вставить(КлючСлужебнойЗаписи(), Истина);
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();

КонецПроцедуры

//Приход с основанием — этим счётом (не помеченный на удаление): его и считаем оплатой, второй не создаём.
Функция ПриходПоСчету(Счет)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Приходы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК Приходы
	|ГДЕ
	|	Приходы.ДокументОснования = &Счет
	|	И НЕ Приходы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Счет", Счет);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Документы.УЗ_ПриходДенег.ПустаяСсылка());

КонецФункции

//Приход денег по оплате: «Касса ученики», касса поступлений по QR, расшифровка по ученикам из счёта (одна строка —
//полями шапки: так приход с одной строкой устроен всегда, СинхронизироватьРасшифровку), проводится.
Функция СоздатьПриход(Объект, ДанныеОплаты, ДатаОплаты)

	Причина = "";
	Параметры = УЗ_ПровайдерыОплатQR.ПараметрыБанка(Объект.Организация, Причина);
	Если Параметры = Неопределено Тогда
		ВызватьИсключение Причина;
	КонецЕсли;
	Причина = ПричинаКассы(Параметры);
	Если Не ПустаяСтрока(Причина) Тогда
		ВызватьИсключение Причина;
	КонецЕсли;
	Приход = Документы.УЗ_ПриходДенег.СоздатьДокумент();
	Приход.Заполнить(Неопределено);
	Приход.Дата = ДатаОплаты;
	Приход.Организация = Объект.Организация;
	Приход.Касса = Параметры.Касса;
	Приход.ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики;
	Приход.Плательщик = Объект.Плательщик;
	Приход.ДокументОснования = Объект.Ссылка;
	Приход.АвторДокумента = Объект.АвторДокумента;
	Приход.НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата по QR (СБП) по счёту № %1 от %2%3'"), СокрЛП(Объект.Номер),
		Формат(Объект.Дата, "ДФ=dd.MM.yyyy"), ?(ПустаяСтрока(ДанныеОплаты.ИдОперации), "",
			", операция " + ДанныеОплаты.ИдОперации));
	Приход.Комментарий = Лев(Приход.НазначениеПлатежа, 255);
	Если Объект.Расшифровка.Количество() = 1 Тогда
		СтрокаОплаты = Объект.Расшифровка[0];
		Приход.ФизЛицо = СтрокаОплаты.Ученик;
		Приход.ПредметОбучения = СтрокаОплаты.ПредметОбучения;
		Приход.Абонемент = СтрокаОплаты.Абонемент;
		Приход.Тариф = СтрокаОплаты.Тариф;
		Приход.СуммаДокумента = СтрокаОплаты.Сумма;
	Иначе
		Для Каждого СтрокаОплаты Из Объект.Расшифровка Цикл
			ЗаполнитьЗначенияСвойств(Приход.РасшифровкаПлатежа.Добавить(), СтрокаОплаты,
				"Ученик, ПредметОбучения, Абонемент, Тариф, Сумма");
		КонецЦикла;
		Приход.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	КонецЕсли;
	Приход.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Возврат Приход.Ссылка;

КонецФункции

//Текст ошибки проведения прихода: сообщения проверок (касса, абонемент, дата запрета) — они понятнее «Операция не
//выполнена».
Функция ТекстОшибкиПрихода(Информация)

	Тексты = Новый Массив;
	Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
		Тексты.Добавить(Сообщение.Текст);
	КонецЦикла;
	Если Тексты.Количество() = 0 Тогда
		Тексты.Добавить(КраткоеПредставлениеОшибки(Информация));
	КонецЕсли;
	Возврат СтрСоединить(Тексты, " ");

КонецФункции

Функция ОжидающиеСчета(Счета)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Счета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_СчетНаОплатуQR КАК Счета
	|ГДЕ
	|	НЕ Счета.ПометкаУдаления
	|	И (&ВсеСчета
	|			ИЛИ Счета.Ссылка В (&Счета))
	|	И (Счета.Статус = ЗНАЧЕНИЕ(Перечисление.УЗ_СтатусыОплатыQR.Ожидает)
	|			ИЛИ Счета.Статус = ЗНАЧЕНИЕ(Перечисление.УЗ_СтатусыОплатыQR.Отменен)
	|				И Счета.СрокДействия > &Граница
	|			ИЛИ Счета.Статус = ЗНАЧЕНИЕ(Перечисление.УЗ_СтатусыОплатыQR.Оплачен)
	|				И Счета.ПриходДенег = ЗНАЧЕНИЕ(Документ.УЗ_ПриходДенег.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счета.Дата";
	Запрос.УстановитьПараметр("ВсеСчета", Счета = Неопределено);
	Запрос.УстановитьПараметр("Счета", ?(Счета = Неопределено, Новый Массив, Счета));
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() - ЗапасСрокаСекунд());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ЕстьОжидающие()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Счета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_СчетНаОплатуQR КАК Счета
	|ГДЕ
	|	Счета.Статус = ЗНАЧЕНИЕ(Перечисление.УЗ_СтатусыОплатыQR.Ожидает)
	|	И НЕ Счета.ПометкаУдаления";
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

//Организации, где у учеников есть долг (остаток денег < 0), — по наименованию.
Функция ОрганизацииСДолгом(Ученики)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	Остатки.Организация.Наименование КАК Наименование
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Остатки(, Клиент В (&Ученики)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Организация,
	|	Остатки.Организация.Наименование
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.СуммаОстаток) < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");

КонецФункции

//Строка ответа бота по одной организации: ссылка на оплату долга или почему нельзя.
Функция СтрокаОплатыБота(Плательщик, Ученики, Организация)

	Строки = СтрокиПоДолгам(Ученики, Организация);
	Сумма = 0;
	Для Каждого СтрокаОплаты Из Строки Цикл
		Сумма = Сумма + СтрокаОплаты.Сумма;
	КонецЦикла;
	Если Сумма <= 0 Тогда
		Возврат СтрШаблон(НСтр("ru = '«%1»: долга нет.'"), Организация);
	КонецЕсли;
	Если Не ПустаяСтрока(ПричинаНеготовности(Организация)) Тогда
		Возврат СтрШаблон(НСтр("ru = '«%1»: долг %2 руб. Оплата по ссылке не подключена — оплатите у администратора.'"),
			Организация, Формат(Сумма, "ЧДЦ=2; ЧН=0,00"));
	КонецЕсли;
	Счет = ДействующийСчетБота(Плательщик, Организация, Сумма);
	Если Не ЗначениеЗаполнено(Счет) Тогда
		Объект = Документы.УЗ_СчетНаОплатуQR.СоздатьДокумент();
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Организация;
		Объект.Плательщик = Плательщик;
		Объект.Комментарий = НСтр("ru = 'Бот Telegram: /оплатить'");
		Для Каждого СтрокаОплаты Из Строки Цикл
			ЗаполнитьЗначенияСвойств(Объект.Расшифровка.Добавить(), СтрокаОплаты);
		КонецЦикла;
		Объект.Записать();
		Счет = Объект.Ссылка;
	КонецЕсли;
	Выставлено = ВыставитьQRСчета(Счет);
	Если Не Выставлено.Успех Тогда
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыОплатQR.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УЗ_СчетНаОплатуQR, Счет, Выставлено.ТекстОшибки);
		Возврат СтрШаблон(НСтр("ru = '«%1»: долг %2 руб. Ссылку на оплату получить не удалось — попробуйте позже или
			|оплатите у администратора.'"), Организация, Формат(Сумма, "ЧДЦ=2; ЧН=0,00"));
	КонецЕсли;
	Возврат ТекстСсылки(Счет);

КонецФункции

//Счёт этого плательщика и организации на ту же сумму, чей QR ещё действует не меньше 5 минут.
Функция ДействующийСчетБота(Плательщик, Организация, Сумма)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Счета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_СчетНаОплатуQR КАК Счета
	|ГДЕ
	|	Счета.Плательщик = &Плательщик
	|	И Счета.Организация = &Организация
	|	И Счета.СуммаДокумента = &Сумма
	|	И Счета.Статус = ЗНАЧЕНИЕ(Перечисление.УЗ_СтатусыОплатыQR.Ожидает)
	|	И Счета.СрокДействия > &Граница
	|	И НЕ Счета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счета.СрокДействия УБЫВ";
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сумма", Сумма);
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() + 300);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Документы.УЗ_СчетНаОплатуQR.ПустаяСсылка());

КонецФункции

#КонецОбласти
